[
  {
    "title": "House style recognition using deep convolutional neural network",
    "abstract": "The recent development in deep learning has opened up a new era of possibilities, once difficult to achieve with conventional methods, to revolutionize image recognition, speech recognition, and natural language processing. Specifically, image recognition has been widely applied in various areas such as face recognition, object identification for security, and other purposes. Although it is rarely applied to discover new methods for use in architecture, image recognition has great potential in architectural design. For example, it can be used to identify the preference of the client and to design a building that satisfies a client's aesthetic preference. One of the major hurdles of utilizing image recognition in architecture is the architectural styles based on culture, location, and time. For that reason, it is difficult to identify an architectural style by non-trained clients and sometimes certain buildings are composed of different styles that are difficult to identify by experts as one style. This paper explores the possibility of using state-of-the-art image recognition algorithms in house style recognition to find out its limitations and possibilities. Moreover, the paper adopted a convolutional neural network model for classifying house styles in the US. Although the final accuracy is not high due to the lack of image datasets, the trained model performed reasonable predictions with a limited test set. The results show the importance of properly defining style for image recognition to improve its accuracy. © 2020 Elsevier B.V.",
    "eid": "2-s2.0-85087091465"
  },
  {
    "title": "Brightearth City Texturing : Faithful Procedural 3d Urban Modeling From Satellite and Ground Imagery",
    "abstract": "BrightEarth City Texturing is an automatic and resource-efficient 3D urban modeling pipeline, producing quality low-poly 3D models with high-resolution seamless textures suitable for real-time rendering. From a single satellite image it extracts building geometry with footprint polygons along with attributes such as building height, roof shape, and roof texture. If ground images are available it can also faithfully texture facades in terms of architectural style. © 2023 IEEE.",
    "eid": "2-s2.0-85178336467"
  },
  {
    "title": "Classification of architectural styles in Chinese traditional settlements using remote sensing images and building facade pictures",
    "abstract": "The classification of Chinese traditional settlements (CTSs) is extremely important for their differentiated development and protection. The innovative double-branch classification model developed in this study comprehensively utilized the features of remote sensing (RS) images and building facade pictures (BFPs). This approach was able to overcome the limitations of previous methods that used only building facade images to classify settlements. First, the features of the roofs and walls were extracted using a double-branch structure, which consisted of an RS image branch and BFP branch. Then, a feature fusion module was designed to fuse the features of the roofs and walls. The precision, recall, and F1-score of the proposed model were improved by more than 4% compared with the classification model using only RS images or BFPs. The same three indexes of the proposed model were improved by more than 2% compared with other deep learning models. The results demonstrated that the proposed model performed well in the classification of architectural styles in CTSs. © Science Press 2024.",
    "eid": "2-s2.0-85211352369"
  },
  {
    "title": "FLsM: Fuzzy Localization of Image Scenes Based on Large Models",
    "abstract": "This article primarily focuses on the study of image-based localization technology. While traditional methods have made significant advancements in technology and applications, the emerging field of visual image-based localization technology demonstrates tremendous potential for research. Deep learning has exhibited a strong performance in image processing, particularly in developing visual navigation and localization techniques using large-scale visual models. This paper introduces a sophisticated scene image localization technique based on large models in a vast spatial sample environment. The study involved training convolutional neural networks using millions of geographically labeled images, extracting image position information using large model algorithms, and collecting sample data under various conditions in elastic scene space. Through visual computation, the shooting position of photos was inferred to obtain the approximate position information of users. This method utilizes geographic location information to classify images and combines it with landmarks, natural features, and architectural styles to determine their locations. The experimental results show variations in positioning accuracy among different models, with the most optimal model obtained through training on a large-scale dataset. They also indicate that the positioning error in urban street-based images is relatively small, whereas the positioning effect in outdoor and local scenes, especially in large-scale spatial environments, is limited. This suggests that the location information of users can be effectively determined through the utilization of geographic data, to classify images and incorporate landmarks, natural features, and architectural styles. The study’s experimentation indicates the variation in positioning accuracy among different models, highlighting the significance of training on a large-scale dataset for optimal results. Furthermore, it highlights the contrasting impact on urban street-based images versus outdoor and local scenes in large-scale spatial environments. © 2024 by the authors.",
    "eid": "2-s2.0-85195794021"
  },
  {
    "title": "Research on Image Classification and Retrieval Using Deep Learning with Attention Mechanism on Diaspora Chinese Architectural Heritage in Jiangmen, China",
    "abstract": "The study of the architectural heritage of the Chinese diaspora has an important role and significance in China’s historical and cultural background in the preservation of cultural data, the restoration of images, and in the analysis of human social and ideological conditions. The images from the architectural heritage of the Chinese diaspora usually include frescos, decorative patterns, chandelier base patterns, various architectural styles and other major types of architecture. Images of the architectural heritage of the Chinese diaspora in Jiangmen City, Guangdong Province, China are the research object of this study. A total of 5073 images of diaspora Chinese buildings in 64 villages and 16 towns were collected. In view of the fact that different types of image vary greatly in features while there are only small differences among the features of the same type of image, this study uses the depth learning method to design the Convolutional Neural Network Attention Retrieval Framework (CNNAR Framework). This approach can be divided into two stages. In the first stage, the transfer learning method is used to classify the image in question by transferring the trained parameters of the Paris500K datasets image source network to the target network for training, and thus the classified image is obtained. The advantage of this method is that it narrows the retrieval range of the target image. In the second stage, the fusion attention mechanism is used to extract the features of the images that have been classified, and the distance between similar images of the same type is reduced by loss of contrast. When we retrieve images, we can use the features extracted in the second stage to measure the similarities among them and return the retrieval results. The results show that the classification accuracy of the proposed method reaches 98.3% in the heritage image datasets of the JMI Chinese diaspora architectures. The mean Average Precision (mAP) of the proposed algorithm can reach 76.6%, which is better than several mainstream model algorithms. At the same time, the image results retrieved by the algorithm in this paper are very similar to those of the query image. In addition, the CNNAR retrieval framework proposed in this paper achieves accuracies of 71.8% and 72.5% on the public data sets Paris500K and Corel5K, respectively, which can be greatly generalized and can, therefore, also be effectively applied to other topics datasets. The JMI architectural heritage image database constructed in this study, which is rich in cultural connotations of diaspora Chinese homeland life, can provide strong and reliable data support for the follow-up study of the zeitgeist of the culture reflected in architecture and the integration of Chinese and Western aesthetics. At the same time, through the rapid identification, classification, and retrieval of precious architectural images stored in the database, similar target images can be retrieved reasonably and accurately; then, accurate techniques can be provided to restore old and damaged products of an architectural heritage. © 2023 by the authors.",
    "eid": "2-s2.0-85149232343"
  },
  {
    "title": "6th International Conference on Dynamics of Information Systems, DIS 2023",
    "abstract": "The proceedings contain 18 papers. The special focus in this conference is on Dynamics of Information Systems. The topics include: Dispersion of Personal Spaces; an Evolutionary Approach to Automated Class-Specific Data Augmentation for Image Classification; augmented Lagrangian Method for Linear Programming Using Smooth Approximation; the Coherent Multi-representation Problem for Protein Structure Determination; the Effects of Shift Generation on Staff Rostering; consumers Financial Distress: Prediction and Prescription Using Machine Learning; optimizing Classroom Assignments to Reduce Non-essential Interactions Among University-Level Students During Pandemics; introducing a New Metric for Improving Trustworthiness in Real Time Object Detection; a Numerical Scheme for a Generalized Fractional Derivative with Variable Order; a Risk-Cost Analysis for an Increasingly Widespread Monitoring of Railway Lines; a Collaborative Multi-objective Approach for Clustering Task Based on Distance Measures and Clustering Validity Indices; iranian Architectural Styles Recognition Using Image Processing and Deep Learning; a Quasi-extreme Reduction for Interval Transportation Problems; assignment of Unexpected Tasks in Embedded System Design Process Using Genetic Programming; Improving Handwritten Cyrillic OCR by Font-Based Synthetic Text Generator; a Critical Node-Centric Approach to Enhancing Network Security.",
    "eid": "2-s2.0-85182012408"
  },
  {
    "title": "Study on the classification of building based on ResNet",
    "abstract": "In real estate appraisal, the building conditions have a significant impact on the asset value. The condition of the building can be estimated based on the characteristics of the external wall materials, architectural style and appearance. Such estimates are complicated because images of buildings contain a lot of confusing information, including different angles and weather Now it is often based on the appraiser's experience, but this introduces too many human factors. Increasingly sophisticated artificial intelligence technology can help solve these problems and provide accurate and objective evaluation of buildings. For practical application, this paper divides buildings into three categories with different values according to their conditions. Then train the building images and verify the accuracy by ResNet-152 neural network. The experimental results show that ResNet-152 has a high accuracy and adaptability for building classification tasks.  © 2023 IEEE.",
    "eid": "2-s2.0-85186766168"
  },
  {
    "title": "Deep Learning Understanding Of Skin Disease Management",
    "abstract": "Deep learning methods are effective in learning characteristics that aid in accurately interpreting complicated patterns. This study presented a deep attempt to learn Mobile Net Setup and Strong Real Limit Memory-based automated approach for identifying skin diseases (LSTM). The Convolution neural network V2 model has proven to be efficient and accurate and it can operate on lightweight computing devices. The suggested model is effective at preserving tasteful information for accurate predictions. To measure the progression of pathological growth, a grey-level founder matrix is utilized. The results were compared to other cutting - edge models such as Exquisite Deep Neural network (FTNN), Convolution Neural Networks (CNN), Very Convolution Neural Networks for Large - scale image Recognizing established by Radial Basis function Group (VGG), and deep neural networks architectural styles that expanded with few changes. The Intermediate representation dataset is employed, and the suggested strategy outperforms existing methods by more than 85%. Its resilience in recognizing the afflicted region significantly faster and with almost twice as few calculations as the typical Convolution neural network model results in minimum computing effort. Additionally, a software program is intended to take immediate and appropriate action. It assists patients and dermatologists in determining the kind of disease from images of the afflicted region during the early stages of skin disease. These findings imply that the suggested method can assist general practitioners in swiftly and effectively diagnosing skin disorders, preventing future complications and morbidity. © 2022 IEEE.",
    "eid": "2-s2.0-85135489729"
  },
  {
    "title": "Comparison of ResNet50V2 and MobileNetV2 Models in Building Architectural Style Classification",
    "abstract": "Artificial intelligence and image processing methods are key in classifying architectural styles in this digital era. Previous research has demonstrated the success of Deep Learning (DL) and Convolutional Neural Network (CNN) techniques in classifying architectural styles, but variations in accuracy and challenges in dealing with variations in lighting, shooting angles, and complexity of architectural styles remain a concern. Through literature exploration, it was found that a direct comparison between the ResNet50V2 and MobileNetV2 models in the context of architectural style classification has never been carried out thoroughly. Disadvantages of existing methods include a better understanding of the model's ability to distinguish subtle nuances in architectural design. This research aims to compare the performance of ResNet50V2 and MobileNetV2 in architectural style classification. ResNet50V2 achieved 93% accuracy, while MobileNetV2 achieved 82%. Graphical analysis and evaluation metrics, including confusion matrices and classification reports, provide deep insight into their performance. In conclusion, ResNet50V2 and MobileNetV2 have their respective advantages and disadvantages. ResNet50V2 shows high and stable accuracy, while MobileNetV2 shows stability with certain fluctuations. Both models have the potential to be used in architectural style classification, but model selection must consider the specific needs and characteristics of the dataset. This research is expected to provide valuable guidance for developing more efficient and reliable classification methods in understanding and preserving building architectural styles. This research contribution is relevant to the industrial development trend, which increasingly relies on technology to increase efficiency and accuracy in various tasks. © 2024 IEEE.",
    "eid": "2-s2.0-85202355094"
  },
  {
    "title": "The Classification Method of Urban Architectural Styles Based on Deep Learning and Street View Imagery",
    "abstract": "The task of identifying urban architectural styles occupies a very necessary position in the fields of construction of smart cities, sustainable urban development and community regeneration. The research method proposed in this paper can improve on the inconveniences of traditional methods of identifying urban architectural styles, such as: the community building is relatively old, and the integration of more periods of architectural style can significantly affect the test results. It is an established fact that data cannot be collected and processed efficiently by humans alone, and can not enter such qualitative and descriptive research methods into the computer for auxiliary research. This paper is based on the explosion of information data use in the 21st century, and use deep learning technology to process unstructured data with convolutional neural networks as the core to assist in the identification of urban architectural styles. With the rapid development of deep learning technology in recent years, its classification techniques for identification of street images of urban buildings can be used for urban management, and a new strong underpinning for the allocation of urban resources, urban diversification management, and the transformation of old communities in the later period has been provided by the proper classification of urban architectural styles. Notwithstanding its restrictions, the approach presented in this research has shown promise and the valuable value of deep learning-based techniques for the study of architectural styles, and this approach has universal significance.  © 2022 The authors and IOS Press.",
    "eid": "2-s2.0-85145256022"
  },
  {
    "title": "Investigation, Evaluation, and Dynamic Monitoring of Traditional Chinese Village Buildings Based on Unmanned Aerial Vehicle Images and Deep Learning Methods",
    "abstract": "The investigation, evaluation, and dynamic monitoring of traditional village buildings are crucial for the protection and inheritance of their architectural styles. This study takes traditional villages in Shandong Province, China, as an example, employing UAV images and deep learning technology. Utilizing the YOLOv8 instance segmentation model, it introduces three key features reflecting the condition of traditional village buildings: roof status, roof form, and courtyard vegetation coverage. By extracting feature data on the condition of traditional village buildings and constructing a transition matrix for building condition changes, combined with corresponding manual judgment assistance, the study classifies, counts, and visually outputs the conditions and changes of buildings. This approach enables the investigation, evaluation, and dynamic monitoring of traditional village buildings. The results show that deep learning technology significantly enhances the efficiency and accuracy of traditional village architectural investigation and evaluations, and it performs well in dynamic monitoring of building condition changes. The “UAV image + deep learning” technical system, with its simplicity, accuracy, efficiency, and low cost, can provide further data and technical support for the planning, protection supervision, and development strategy formulation of traditional Chinese villages. © 2024 by the authors.",
    "eid": "2-s2.0-85207335339"
  },
  {
    "title": "Iranian Architectural Styles Recognition Using Image Processing and Deep Learning",
    "abstract": "Iranian architecture, also known as Persian architecture, encompasses the design of buildings in Iran and extends to various regions in West Asia, the Caucasus, and Central Asia. With a rich history dating back at least 5,000 BC, it boasts distinctive features and styles. Iran, located in the Middle East, has faced ongoing geopolitical challenges, including the potential for conflicts, such as those in Iraq and Afghanistan. Unfortunately, historical monuments often become unintentional casualties during wartime, suffering damage or destruction. These historical monuments hold cultural and historical significance not only for the country they belong to but for all of humanity. Therefore, it is crucial to make efforts to preserve them. In this paper, we propose the development of an automated system utilizing Deep Learning methods for the detection and recognition of historical monuments. This system can be integrated into military equipment to help identify the architectural style of a building and determine its construction date. By doing so, it can provide a critical warning to prevent the targeting of historically significant structures. To support our system, we have curated a dataset consisting of approximately 3,000 photographs showcasing six distinct styles of Iranian historical architecture. Figure 1 provides some examples of these photographs. It is worth noting that this dataset can be valuable for various scientific research projects and applications beyond our proposed system. Additionally, it offers tourists the opportunity to learn about Iranian historical monuments independently, using their mobile phones to access information about a monument’s historical period and architectural style, eliminating the need for a traditional guide. This initiative aims to safeguard the invaluable cultural heritage of Iran and neighboring regions, contributing to the collective preservation of these historical treasures. © 2024, The Author(s), under exclusive license to Springer Nature Switzerland AG.",
    "eid": "2-s2.0-85181976688"
  },
  {
    "title": "Protein secondary structure prediction with context convolutional neural network",
    "abstract": "Protein secondary structure (SS) prediction is important for studying protein structure and function. Both traditional machine learning methods and deep learning neural networks have been utilized and great progress has been achieved in approaching the theoretical limit. Convolutional and recurrent neural networks are two major types of deep learning architectures with comparable prediction accuracy but different training procedures to achieve optimal performance. We are interested in seeking a novel architectural style with competitive performance and in understanding the performance of different architectures with similar training procedures. We constructed a context convolutional neural network (Contextnet) and compared its performance with popular models (e.g. convolutional neural network, recurrent neural network, conditional neural fields...) under similar training procedures on a Jpred dataset. The Contextnet was proven to be highly competitive. Additionally, we retrained the network with the Cullpdb dataset and compared with Jpred, ReportX, Spider3 server and MUFold-SS method, the Contextnet was found to be more Q3 accurate on a CASP13 dataset. Training procedures were found to have significant impact on the accuracy of the Contextnet. © 2019 The Royal Society of Chemistry.",
    "eid": "2-s2.0-85075923847"
  },
  {
    "title": "Building Edge Detection Technology from Remote Sensing Image Based on NSCT and Tensor Voting",
    "abstract": "An edge detection technology based on the combination of non-downsampling contour wave transform (NSCT) and tensor voting is proposed, which aims to obtain more accurate and detailed edge information of buildings in remote sensing images. Firstly, NSCT is used for image decomposition to obtain the subband frequency information of different scales and angles. Then, position encoding is performed on these subband coefficients to obtain second-order symmetric tensors at the corresponding positions. Tensors of different scales and angles at the same position are weighted and summed to complete feature fusion. Finally, the edge features of the image are obtained based on tensor voting theory. The experimental results show that compared to common edge detection technologies, such as Canny, Fast Edge (Fast edge detection using structured forests) and HED (Holistically-Nested Edge Detection), our method can more accurately and intensively reflect the boundaries of buildings and the edge information of roofs, providing better support for the analysis of building types and architectural styles. Compared to the HED method, which is based on deep learning, our method improves PSNR and SSIM metrics by 0.98 and 0.03, respectively.  © Published under licence by IOP Publishing Ltd.",
    "eid": "2-s2.0-85194173065"
  },
  {
    "title": "Urban Architectural Style Recognition and Dataset Construction Method under Deep Learning of street View Images: A Case Study of Wuhan",
    "abstract": "The visual quality and spatial distribution of architectural styles represent a city’s image, influence inhabitants’ living conditions, and may have positive or negative social consequences which are critical to urban sensing and designing. Conventional methods of identifying architectural styles rely on human labor and are frequently time-consuming, inefficient, and subjective in judgment. These issues significantly affect the large-scale management of urban architectural styles. Fortunately, deep learning models have robust feature expression abilities for images and have achieved highly competitive results in object detection in recent years. They provide a new approach to supporting traditional architectural style recognition. Therefore, this paper summarizes 22 architectural styles in a study area which could be used to define and describe urban architectural styles in most Chinese urban areas. Then, this paper introduced a Faster-RCNN general framework of architectural style classification with a VGG-16 backbone network, which is the first machine learning approach to identifying architectural styles in Chinese cities. Finally, this paper introduces an approach to constructing an urban architectural style dataset by mapping the identified architectural style through continuous street view imagery and vector map data from a top-down building contour map. The experimental results show that the architectural style dataset created had a precision of 57.8%, a recall rate of 80.91%, and an F1 score of 0.634. This dataset can, to a certain extent, reflect the geographical distribution characteristics of a wide variety of urban architectural styles. The proposed approach could support urban design to improve a city’s image. © 2023 by the authors.",
    "eid": "2-s2.0-85166183971"
  },
  {
    "title": "Building pose detection for the characterization of reinforced concrete buildings",
    "abstract": "The automated identification of building characteristics for seismic vulnerability remains a challenge for governments due to the high number of buildings in cities. The diverse architectural styles of these buildings complicate the automated identification of building information (e.g., number of stories, structural system, and material type). Deep learning techniques lose accuracy as they generalize information, while the visual contents of a building exhibit a considerable range and diversity. This study leverages the pose detection technique to tackle such issues by focusing on a common construction style: reinforced concrete buildings representing columns, beams, or floors on the façade. With an aim to enable the assessment of seismic vulnerability, the technique developed herein is conceived for buildings with up to six stories that are more likely to be moment-frame buildings. The AI-enabled proposed framework starts with collecting building images and categorizing those containing this specific building type. A bounding box detector is then used to isolate building facades, for the subsequent identification of the structural frame with the High-Resolution Network (HR-Net). For demonstration, we illustrate this technique by identifying the structural frame on concrete buildings with a sample dataset developed based on buildings found in Mexico City in a pre-earthquake event state. © 2024 John Wiley & Sons Ltd.",
    "eid": "2-s2.0-85192257650"
  },
  {
    "title": "Intelligent machine vision model for building architectural style classification based on deep learning",
    "abstract": "This paper presents an intelligent model for building architectural style classification. Image classification of architectural style is challenging to traditional machine vision methods. The main challenge in these systems is the feature extraction phase as there are many visual features in these styles that need to be extracted, refined and optimised. All these operations are done at the researcher discretion in traditional Machine Learning (ML) models. The advancements of ML to Deep Learning (DL) made automation of all the challenging operations possible. We constructed a machine vision model based on DL to investigate the effectiveness of DL in the classification problem at hand. A publicly available annotated data set was utilised to train and validate the proposed model. The data set consists of more than 5000 images of eight different architectural styles. The experimental results showed that the proposed model is reliable as it produced a classification accuracy of 95.44%. Copyright © 2022 Inderscience Enterprises Ltd.",
    "eid": "2-s2.0-85153874123"
  },
  {
    "title": "Architectural Style Classification Based on Deep Learning",
    "abstract": "This article analyzes the efficient classification of computer models using different architectural styles. A precise feature application for computer-aided design was constructed by evaluating and classifying CAD data training. A deep learning-based model was used for building model training. The research experiment uses the evaluation model's test dataset classification information during the iterative process. Under strict training indicators, the test dataset showed a high-performance level in classifying architectural styles. In the automatic extraction process of architectural images, the method proposed in this article has a high ability for style transformation in processing architectural style data models. In the process of precise automatic extraction of architectural style, the model has a deeper efficiency in building data. This has high accuracy and application value in the style conversion of image architecture. © 2025 U-turn Press LLC.",
    "eid": "2-s2.0-85197354170"
  },
  {
    "title": "Urban fabric decoded: High-precision building material identification via deep learning and remote sensing",
    "abstract": "Precise identification and categorization of building materials are essential for informing strategies related to embodied carbon reduction, building retrofitting, and circularity in urban environments. However, existing building material databases are typically limited to individual projects or specific geographic areas, offering only approximate assessments. Acquiring large-scale and precise material data is hindered by inadequate records and financial constraints. Here, we introduce a novel automated framework that harnesses recent advances in sensing technology and deep learning to identify roof and facade materials using remote sensing data and Google Street View imagery. The model was initially trained and validated on Odense's comprehensive dataset and then extended to characterize building materials across Danish urban landscapes, including Copenhagen, Aarhus, and Aalborg. Our approach demonstrates the model's scalability and adaptability to different geographic contexts and architectural styles, providing high-resolution insights into material distribution across diverse building types and cities. These findings are pivotal for informing sustainable urban planning, revising building codes to lower carbon emissions, and optimizing retrofitting efforts to meet contemporary standards for energy efficiency and emission reductions. © 2025",
    "eid": "2-s2.0-85217756418"
  },
  {
    "title": "Understanding architecture age and style through deep learning",
    "abstract": "Architectural styles and their evolution are central to architecture history. However, traditional approaches to understand styles and their evolution require domain expertise, fieldwork and extensive manual processes. Recent research in deep learning and computer vision has highlighted the great potential in analyzing urban environments from images. In this paper, we propose a deep learning-based framework for understanding architectural styles and age epochs by deciphering building façades based on street-level imagery. The framework is composed of two stages: Deep ‘Learning’ the architecture and Deep ‘Interpreting’ the architecture age epochs and styles. In Deep ‘Learning’, a deep convolutional neural network (DCNN) model is designed to automatically learn about the age characteristics of building façades from street view images. In Deep ‘Interpreting’ stage, three components are proposed to understand the different perspectives regarding building ages and styles. In the experiment, a building age epoch dataset is compiled for the city of Amsterdam and Stockholm to understand the evolution of architectural element styles and the relationship between building ages and styles spatially and temporally. This research illustrates how publicly available data and deep learning could be used to trace the evolution of architectural styles in the spatial-temporal domain. © 2022",
    "eid": "2-s2.0-85131439428"
  },
  {
    "title": "Hierarchical (multi-label) architectural image recognition and classification",
    "abstract": "The task of architectural image recognition for both architectural functionality and style remains an open challenge. In addition, the paucity of well-organized, large-scale architectural image datasets with specific consideration for the domain of architectural design research has hindered the exploration of these challenging tasks. Drawing upon images from the professional architectural website Archdaily®, and leveraging state-of-the-art deep-learning-based classification models, we explore a hierarchical multi-label classification model as a potential baseline for the task of architectural image classification. The resulting model showcases the potential for innovative architectural discipline-related analyses and demonstrates some heuristic insights for visual feature extraction pertaining to both architectural functionality and architectural style. © 2021 and published by the Association for Computer-Aided Architectural Design Research in Asia (CAADRIA), Hong Kong.",
    "eid": "2-s2.0-85104623071"
  },
  {
    "title": "BUILDING FOOTPRINT EXTRACTION FROM SPACE-BORNE IMAGERY USING DEEP NEURAL NETWORKS",
    "abstract": "One of the important and high-level detailing contained within basemaps is the ĝ€building feature'. Though pre-trained Deep Learning (DL) models are available for Building Feature Extraction (BFE), they are not efficient in predicting the buildings in other locations. This study explores the need and the major issue of implementing DL models for BFE from Very High Resolution Remote Sensing (VHRS) satellite data for any given area. Though advanced DL models are invented, in order to implement them, huge amount of potential training data is demanded for feed in. the building typologies are highly subjected to the context of study area including soil characteristics, culture/lifestyle/economy, architectural style and the building byelaws. The study believes that availability of enough training data of contextual buildings as one of the concern for effective model training. The study aims to extract the buildings present in the study area from Pleiades 1A (2019) RGB VHRS data using simple Mask R-CNN instance segmentation model which is training on the native contextual buildings. Here, an automated method of generating the location-specific training data for a given area is followed using Google Maps API (2021). The generated training data when trained on a deep learning architecture and predicted by the input data yielded promising results. The prediction accuracy of about 98.41% specificity, 96.20% predictive accuracy and 0.89 F1 score are achieved. The methods adopted assist the planning/governing bodies to accelerate the qualitative urban map preparation.  © 2022. International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences - ISPRS Archives. All rights reserved.",
    "eid": "2-s2.0-85132034919"
  },
  {
    "title": "The Φ-stack for SmartWeb of things",
    "abstract": "With the emergence of smart IoT, a key problem has becoming increasingly acute: The \"Paradox of Classis Insecta\", which in industry is called the fragmentation problem. We propose an architecture called Smart Web of Things (SWoT) to address this problem. The SWoT architecture extends the REST architectural style that has been validated by PC Web and mobile Web to the smart IoT arena. However, previous researches have shown that such extension is nontrivial. According to Vint Cerf, intelligentWeb is heavy, difficult to be realized in resource constrained smart IoT devices. We propose a novel co-designed hardware-software stack, called Φ-Stack, to natively support Web and intelligence (e.g., pattern recognition and deep learning), with minimized cost, footprint, response time, and energy consumption. This hardware-software stack must be an open architecture, to encourage innovations and accommodate diversity inherent in the smart IoT field. Preliminary experiment results show that our approach is promising in extending the Web technology to resource constrained smart IoT environments and helpful in partially unifying APIs and interactions among smart IoT devices. © 2017 Association for Computing Machinery.",
    "eid": "2-s2.0-85036659766"
  },
  {
    "title": "Architectural style classification of Mexican historical buildings using deep convolutional neural networks and sparse features",
    "abstract": "We propose a convolutional neural network to classify images of buildings using sparse features at the network's input in conjunction with primary color pixel values. As a result, a trained neuronal model is obtained to classify Mexican buildings in three classes according to the architectural styles: prehispanic, colonial, and modern with an accuracy of 88.01%. The problem of poor information in a training dataset is faced due to the unequal availability of cultural material. We propose a data augmentation and oversampling method to solve this problem. The results are encouraging and allow for prefiltering of the content in the search tasks. © 2016 SPIE and IS&T.",
    "eid": "2-s2.0-85007240156"
  },
  {
    "title": "Scrutinization of mammogram images using deep learning",
    "abstract": "Progressive steps were taken by the deep learning model in a multitude of implementations. The main source of interest is the convolutional neural network (CNN), which is regarded as a prominent potent method for discovering incentive of images and other semantic information. Datasets include images taken using a innumerable imaging modalities, including MRIs, scans—CT and PET (Positron Emission Tomography), X-rays, ultrasounds, fluorescein angiography, and even photographs. This study examines several deep learning method design patterns and partially centers on the CNN, which provides an exceptional percentage of solutions when compared to other DNN (Deep Neural Network) architectures. CNN prioritizes image features and uses recognizable architectural styles. However, restrictions that go beyond DNN training and execution time will be discussed. Finally, a comparison of current software frameworks for deep learning method will be presented, along with future research prospects. The cornerstone of this exploration is to look at approaches to implement a deep learning model that can accurately identify breast cancer so that late medications can be mitigated because of inaccurate negatives and unnecessary medications can be avoided owing to wrongful convictions. A dataset of 1312 photos was used, which included photographs of both benign and malignant kinds. The models ResNet50, DenseNet201, AlexNet, and VGG16 are used. Without any transfer learning, we attain the best accuracy for our basic model. Augmentation is a technique for rescaling data and reducing overfitting. When validated on a well-known globally available set of data, the existing technique yields better output. Existing models are also helpful in medical image analysis, as they execute exactly with a low loss function. © 2024 Elsevier Inc. All rights reserved.",
    "eid": "2-s2.0-85191139913"
  },
  {
    "title": "Generative Deep Learning in Architectural Design",
    "abstract": "Generative Adversarial Networks (GANs) are an emerging research area in deep learning that have demonstrated impressive abilities to synthesize designs, however, their application in architectural design has been limited. This research provides a survey of GAN technologies and contributes new knowledge on their application in select architectural design tasks involving the creation and analysis of 2D and 3D designs from specific architectural styles. Experimental results demonstrate how the curation of training data can be used to control the fidelity and diversity of generated designs. Techniques for working with small training sets are introduced and shown to improve the visual quality of synthesized designs. Lastly, experiments demonstrate how GANs might be used analytically to gain insight into specific architectural oeuvres. © 2019, © 2019 Association of Collegiate Schools of Architecture.",
    "eid": "2-s2.0-85074142778"
  },
  {
    "title": "An extraction method for roof point cloud of ancient building using deep learning framework",
    "abstract": "Chinese ancient architecture is a valuable heritage wealth, especially for roof that reflects the construction age, structural features and cultural connotation. Point cloud data, as a flexible representation with characteristics of fast, precise, non-contact, plays a crucial role in a variety of applications for ancient architectural heritage, such as 3D fine reconstruction, HBIM, disaster monitoring etc. However, there are still many limitations in data editing tasks that need to be worked out manually, which is time-consuming, labor-intensive and error-prone. In recent years, the theoretical advance on deep learning has stimulated the development of various domains, and digital heritage is not in exception. Whenever, deep learning algorithm need to consume a huge amount of labeled date to achieve the purpose for segmentation, resulting a actuality that high labor costs also be acquired. In this paper, inspired by the architectural style similarity between mimetic model and real building, we proposed a method supported by deep learning, which aims to give a solution for the point cloud automatic extraction of roof structure. Firstly, to generate real point cloud, Baoguang Temple, unmanned Aerial Vehicle (UAV) is presented to obtain image collections that are subsequently processed by reconstruction technology. Secondly, a modified Dynamic Graph Convolutional Neural Network (DGCNN) which can learn local features with taking advantage of an edge attention convolution is trained using simulated data and additional attributes of geometric attributes. The mimetic data is sampled from 3DMAX model surface. Finally, we try to extract roof structure of ancient building from real point clouds scenes utilizing the trained model. The experimental results show that the proposed method can extract the rooftop structure from real scene of Baoguang, which illustrates not only effectiveness of approach but also a fact that the simulated source perform potential value when real point cloud datasets are scarce. © 2021 International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences - ISPRS Archives. All Rights Reserved.",
    "eid": "2-s2.0-85118569784"
  },
  {
    "title": "Feasibility Analysis of an AI-Based Classification System for Cultural Heritage Building",
    "abstract": "The country's historical and artistic heritage represents its identity and history. Art cities are often influenced by different architectural styles, sometimes easily distinguishable, thanks to characteristic elements, other times less so, due to influences caused by transition periods from one style to another, or by interventions over the centuries. Artificial Intelligence in recent years, has proven to be a valuable tool in the field of image classification, given its capacity to yield robust solutions across diverse domains. However, its application in the cultural heritage building image classification context remains relatively unexplored. This paper presents a preliminary feasibility study aimed at investigating the potential of deep learning techniques for the classification of cultural heritage building images. The goal could be to build a solution that can recognize, given an image of a historic building, the architectural style, which could improve the experience of a tourist who wants to know more about the visited place's history. The paper examines the results obtained with different neural network architectures, exploiting the Transfer Learning technique, but also draws attention to the challenges of the domain. Overall, encouraging results (AUC 0.98 and F1-score equal to 94-95%), demonstrate the effectiveness of the techniques tested and show how AI can help the classification and preservation of cultural heritage building. © 2024 IEEE.",
    "eid": "2-s2.0-85201201577"
  },
  {
    "title": "Kangba Region of Sichuan based on swin transformer visual model research on the identification of facades of ethnic buildings",
    "abstract": "The protection and restoration of existing buildings requires accurate acquisition of the characteristics of the building facade. The complex, diverse, and irregular distribution characteristics of the building facade components of ethnic minorities have led to a huge workload of field research, surveying, mapping, and calculation, and it is more difficult to extract its facade characteristics accurately. This study proposes a visual model based on the Swin Transformer and applies it to the graphic recognition of ethnic building elevations. The model combines the advantages of the migration learning method and deep neural network technology and is further enriched by layer normalization to improve the stability and extraction ability of model training. In the field survey of ethnic minority buildings in Kangba, Sichuan, 1100 images of local buildings were collected, including 8 different types of ethnic minority buildings. The experimental results show that compared with other mainstream deep neural network models, the Swin Transformer visual model shows excellent predictive performance to prove the effectiveness of the proposed method. This study also uses the t-sne dimension reduction method to verify the feature extraction ability of the Swin Transformer, which contributes to the protection and restoration of ethnic minority buildings, active exploration of energy conservation, digital archiving, and more. Provide theoretical and practical reference in the fields of architectural style and cultural research. © The Author(s) 2024.",
    "eid": "2-s2.0-85209733995"
  },
  {
    "title": "ARCHITECT: EXTRACTING BUILDING RELATED INFORMATIONS AND CHANGING ARCHITECTURAL STYLE IN AR",
    "abstract": "With recent advancements in mobile computing, augmented reality (AR) applications can now achieve real-time performance. AR provides a novel way to engage with our surroundings. Platforms such as ARKit or ARCore make AR app development easy. ARchitect aims to allow users to experience different architectural styles and cultural heritages by altering the appearance of buildings in their environment. The presented solution utilizes deep learning and computer vision techniques to classify architectural styles, which is a challenging task due to the inter-class relationships between styles. The approach presented in the paper alters the style of a building detected from the phone’s camera and retrieves information such as its current style, age, and distance from the user. To train the deep learning models, a publicly available dataset of photos of buildings with 25 different styles is used. The obtained results for architectural style classification surpass state-of-the-art methods, demonstrating the effectiveness of deep learning techniques. Additionally, the presented approach for architectural style transformation is also promising and will improve as new research is conducted in image generation, monocular depth estimation, and surface reconstruction methods. © 2023, Politechnica University of Bucharest. All rights reserved.",
    "eid": "2-s2.0-85169842177"
  },
  {
    "title": "Architectural Style Classification of the Chinese Traditional Settlements using Deep Learning",
    "abstract": "This paper investigates state-of-the-art deep learning techniques to achieve automatic architectural style classification of the Chinese traditional settlements. First, a new annotated dataset is built with six typical Chinese architectural styles, consisting of over 1000 web-crawled images and an original image collection of Chinese traditional settlements. Second, a state-of-the-art convolutional network named DenseNet is benchmarked on the new dataset to learn the effectiveness of the deep learning networks. Yet, the DenseNet network suffered server overfitting on the small-sized new dataset. Third, to overcome the common overfitting problem, a new deep learning framework named DenseNet-TL-Aug is developed by leveraging transfer learning (TL) and data augmentation (DA) techniques, e.g., AutoAugment. The experimental results demonstrate that the new developed framework achieves much better classification performance in classifying the Chinese traditional style images than the original DenseNet, significantly mitigating the overfitting problem. This study will contribute to automated landscape gene recognition as well as the design and development of traditional tourism. © 2023 SPIE.",
    "eid": "2-s2.0-85159308642"
  },
  {
    "title": "Connoisseur: Classification of styles of Mexican architectural heritage with deep learning and visual attention prediction",
    "abstract": "The automatic description of multimedia content was mainly developed for classification tasks, retrieval systems and massive ordering of data. Preservation of cultural heritage is a field of high importance for application to this method. Our problem is classification of architectural styles of buildings in digital photographs of Mexican cultural heritage. The selection of relevant content in the scene for training classification models allows them to be more precise in the classification task. Here we use a saliency-driven approach to predict visual attention in images and use it to train a Convolutional Neural Network to identify the architectural style of Mexican buildings. Also, we present an analysis of the behavior of the models trained under the traditional cropped image and the prominence maps. In this sense, we show that the performance of the saliency-based CNNs is better than the traditional training reaching a classification rate of 97% in validation dataset. It is considered that style identification with this technique can make a wide contribution in video description tasks, specifically in the automatic documentation of Mexican cultural heritage. © 2017 Association for Computing Machinery.",
    "eid": "2-s2.0-85030784474"
  },
  {
    "title": "Research on classification of architectural style image based on convolution neural network",
    "abstract": "Deep learning is a new field in machine learning research. Convolution neural network is the most important factor in image recognition. This paper mainly focuses on the network design and parameter optimization of convolution neural network. This paper is first based on the traditional handwritten digital classification framework LeNet-5 to improve, and implements the test on the ten and twenty-five architectural style data set , and then based on ImageNet-k model design ideas to design a deep convolution neural network structure. The experimental results show that the deeper the network level, the more comprehensive the feature of the image, the better the training effect. In this paper, we study the network design and parameters optimization of convolution neural network, and summarize some practical rules of depth classification on image classification, which is very instructive to solve practical problems. © 2017 IEEE.",
    "eid": "2-s2.0-85043368172"
  },
  {
    "title": "3D façade labeling over complex scenarios: A case study using convolutional neural network and structure-from-motion",
    "abstract": "Urban environments are regions in which spectral variability and spatial variability are extremely high, with a huge range of shapes and sizes, and they also demand high resolution images for applications involving their study. Due to the fact that these environments can grow even more over time, applications related to their monitoring tend to turn to autonomous intelligent systems, which together with remote sensing data could help or even predict daily life situations. The task of mapping cities by autonomous operators was usually carried out by aerial optical images due to its scale and resolution; however new scientific questions have arisen, and this has led research into a new era of highly-detailed data extraction. For many years, using artificial neural models to solve complex problems such as automatic image classification was commonplace, owing much of their popularity to their ability to adapt to complex situations without needing human intervention. In spite of that, their popularity declined in the mid-2000s, mostly due to the complex and time-consuming nature of their methods and workflows. However, newer neural network architectures have brought back the interest in their application for autonomous classifiers, especially for image classification purposes. Convolutional Neural Networks (CNN) have been a trend for pixel-wise image segmentation, showing flexibility when detecting and classifying any kind of object, even in situations where humans failed to perceive differences, such as in city scenarios. In this paper, we aim to explore and experiment with state-of-the-art technologies to semantically label 3D urban models over complex scenarios. To achieve these goals, we split the problem into two main processing lines: first, how to correctly label the façade features in the 2D domain, where a supervised CNN is used to segment ground-based façade images into six feature classes, roof, window, wall, door, balcony and shop; second, a Structure-from-Motion (SfM) and Multi-View-Stereo (MVS) workflow is used to extract the geometry of the façade, wherein the segmented images in the previous stage are then used to label the generated mesh by a \"reverse\" ray-tracing technique. This paper demonstrates that the proposed methodology is robust in complex scenarios. The façade feature inferences have reached up to 93% accuracy over most of the datasets used. Although it still presents some deficiencies in unknown architectural styles and needs some improvements to be made regarding 3D-labeling, we present a consistent and simple methodology to handle the problem. © 2018 by the authors.",
    "eid": "2-s2.0-85053636024"
  },
  {
    "title": "Street-Facing Architectural Image Mapping and Architectural Style Map Generation Method Using Street View Images; [街景影像下的临街建筑风格映射及地图生成方法]",
    "abstract": "Objectives: Each region has specific characteristics of architectural styles, and a detailed investigation of the geographical distribution of architectural styles is conducive to the protection of historic buildings, the development of special tourism resources and the scientific planning of urban architectural areas. However, the number of urban buildings is large, manual collection and investigation cannot meet the needs of large-scale operations. In recent years, Google and other Internet companies have launched street view images. Street view images are high resolution, containing a full range of urban street views as well as precise location and posture information, which provide a possibility to explore the geographic distribution of urban architectural styles. Therefore, we use deep learning to identify and match the styles of street view building areas, and establish a mapping relationship between the building area images and building outlines, so as to construct the generation method of a large-scale urban architectural style map in detail. Methods: The style identification and map matching of architectural areas in street view images are the key and difficulty in generating urban architectural style maps. Firstly, we extract the building area images of various styles through Faster R-CNN. In order to establish the mapping relationship between building area images and single building outlines, we construct a building location mapping method by matching the same name building area in two adjacent street view images, then the building can be located by forward intersection. Secondly, for the single building image without a same-name area, we also propose a building azimuth mapping method, which combines the spatial azimuth relationship between the street view building area and building outlines in a digital map. The intersection of union (IoU) of the single building image azimuth range and the building outline azimuth range can help match the building area in a street view image and building outlines in a digital map. Finally, Technique for order preference by similarity to an ideal solution is used to determine the unique style attribute of each map building outline to solve the multiple mapping problem of a single building and generate a fine-grained architectural style map. Results: The experimental results of the proposed method are as follows: (1) The average accuracy of Faster R-CNN detection of 19 types of architectural style areas on the test set is 73.81%. (2) The accuracy of matching two adjacent street images with the same name architectural area is 86.1%, the recall is 90.3%, and the average time to match an architectural region pair is 180.1 ms, which is 25.4% less than the time using SURF(speeded up robust features) under spherical epipolar geometry constraint and an accuracy improvement of 19.4%; (3) The accuracy of a building location mapping method is 85.1%, the mapping success rate is only 49.33%, and the average time for two corresponding building area to complete location mapping is 2.741 s; the accuracy of the building azimuth mapping method is 80.3%, the mapping success rate is 88.0%, and the average time for a single building area to complete azimuth mapping is 0.017 s. (4) In the test region, the building azimuth mapping method is more likely to cause multiple mapping problems, with 42.9% of the building outlines matching to multiple building images compared to 23.4% for the building location mapping method. (5) By verifying the style attributes of 331 building outlines in a digital map, we obtain a mean classification accuracy of 55.1%, a mean recall of 76.4%, and a mean F1 score of 0.601 for the architectural style maps. Conclusions: Under the two architectural area mapping methods, the generation time of architectural style maps is short, and the F1 score of classification is 0.601, which can basically reflect the geographic distribution characteristics of a large range of urban architectural styles. In addition, the regional and similarity of architectural styles is the main reason for the difficulty in classifying architectural style images, which affects the classification accuracy of architectural style maps and can be studied in more depth in the future. © 2021, Editorial Board of Geomatics and Information Science of Wuhan University. All right reserved.",
    "eid": "2-s2.0-85106970571"
  },
  {
    "title": "Multi-Scale Frequency-Spatial Domain Attention Fusion Network for Building Extraction in Remote Sensing Images",
    "abstract": "Building extraction from remote sensing images holds significant importance in the fields of land resource management, urban planning, and disaster assessment. Encoder-decoder deep learning models are increasingly favored due to their advanced feature representation capabilities in image analysis. However, because of the diversity of architectural styles and issues such as tree occlusion, traditional methods often result in building omissions and blurred boundaries when extracting building footprints. Given these limitations, this paper proposes a cutting-edge Multi-Scale Frequency-Spatial Domain Attention Fusion Network (MFSANet), which consists of two principal modules, named Frequency-Spatial Domain Attention Fusion Module (FSAFM) and Attention-Guided Multi-scale Fusion Upsampling Module (AGMUM). FSAFM introduces frequency domain attention and spatial attention separately to enhance the feature maps, thereby strengthening the model’s boundary-detection capabilities and ultimately improving the accuracy of building extraction. AGMUM first resizes and concatenates attention enhancement maps to enhance contextual understanding and applies attention guidance to further improve prediction accuracy. Our model demonstrates superior performance compared to existing semantic segmentation methods on both the WHU building data set and the Inria aerial image data set. © 2024 by the authors.",
    "eid": "2-s2.0-85211955857"
  },
  {
    "title": "The Novel End-to-End Style Generation Model for Architectural Style Transfer and Classification",
    "abstract": "Architectural design is a multifaceted process that traditionally requires extensive time and expertise, often leading to inefficiencies and prolonged project timelines. This study explores the application of Artificial Intelligence (AI), specifically an optimized CycleGAN, to address these challenges by integrating architectural style transfer and classification into a single, end-to-end model. The model is trained on a diverse dataset comprising modern and traditional architectural styles, enabling it to transform modern architectural images into traditional styles while simultaneously categorizing the architectural style of each input. The results indicate that the model effectively generates traditional architectural styles from modern inputs, capturing key stylistic elements such as texture and form. However, the classification module reveals an imbalance in performance, with higher accuracy and lower loss for traditional style compared to modern style, suggesting areas for improvement. The findings underscore the potential of AI in revolutionizing architectural design, offering a more efficient, accurate, and streamlined process that can significantly enhance the precision and speed of architectural projects. This study contributes to the growing body of research on AI in architecture, demonstrating its applicability in real-world design scenarios. © 2024 IEEE.",
    "eid": "2-s2.0-85213814008"
  },
  {
    "title": "Deep Learning Architect: Classification for Architectural Design Using Artificial Intelligence",
    "abstract": "In this paper, we use cutting-edge deep learning and computer vision to compare architectural designs from various businesses. We trained a squeeze net model using different classification algorithms to identify 1404 architects' photos with 88.6% accuracy by integrating a dataset of web-scraped photographs with our collection of architectural works. By analyzing the weights in the trained Neural Network model, we may determine the extent to which the computer understands common aesthetic traits across architects. We use this metric to categorize buildings by various architects into groups sharing commonalities in their design. We next evaluate our results against the standard categorization used by architects and historians. It is surprising that our classification of architectural styles corroborates commonly held beliefs in the field, and that the acquired knowledge of architectural characteristics is in line with a common appreciation for these styles.  © 2023 IEEE.",
    "eid": "2-s2.0-85190511265"
  },
  {
    "title": "A Review Paper on Real-Time Video Analysis in Dense Environment for Surveillance System",
    "abstract": "Dense environmental conditions such as snow, fog, lightning, heavy rain, and darkness drastically lower the quality of outdoor surveillance videos. The primary functions of video surveillance systems in crowded environments have received significant attention, particularly in detection, categorization, and event or object recognition. The methods and algorithms for real-Time video analysis in various weather conditions have also significantly advanced with the advancement of technology. Examples include background extraction, the see-Through algorithm, deep learning models, CNN for nighttime intrusions, the System for high-quality underwater Monitoring using optical-wireless video surveillance, the low-visibility enhancement network (LVENet), edge computing, and many others. Using various elements of these methodologies, the current research increased monitoring performance and avoided potential human failures. In-depth information about these video surveillance methods, systems, and supporting details is provided in this study. An overview of employed construction and architectural styles is given, and the critical assessments of these systems are then covered. Current surveillance systems and various methods for achieving accuracy in real-Time video analysis in adverse weather circumstances are contrasted in terms of their features, benefits, and challenges, which are discussed in this paper, to provide a complete image and a broad view of the System. Future trends are also highlighted, pointing to the study that will be conducted in the future.  © 2022 IEEE.",
    "eid": "2-s2.0-85150424458"
  },
  {
    "title": "A city-scale estimation of rooftop solar photovoltaic potential based on deep learning",
    "abstract": "The estimation of rooftop solar photovoltaic (PV) potential is crucial for policymaking around sustainable energy plans. But it is difficult to accurately estimate the availability of rooftop area for solar radiation on a city-scale. In this study, a generic framework for estimating the rooftop solar PV potential on a city-scale using publicly available high-resolution satellite images is proposed. A deep learning-based method is developed to extract the rooftop area with image semantic segmentation automatically. A spatial optimization sampling strategy is developed to solve the labor-intensive problem when training the rooftop extraction model based on prior knowledge of urban and rural spatial layout and land use. In the case study of Nanjing, China, the labor cost on preparing the dataset for training the rooftop extraction model has been reduced by about 80% with the proposed spatial optimization sampling strategy. Meanwhile, the robustness of the rooftop extraction model in districts with different architectural styles and land use has been improved. The total rooftop area extracted was 330.36 km2, and the overall accuracy reached 0.92. The estimation results show that Nanjing has significant potential for rooftop-mounted PV installations, and the potential installed capacity reached 66 GW. The annual rooftop solar PV potential was approximately 311,853 GWh, with a corresponding estimated power generation of 49,897 GWh in 2019. © 2021 Elsevier Ltd",
    "eid": "2-s2.0-85108084262"
  },
  {
    "title": "Convolutional Neural Network in the Classification of Architectural Styles of Buildings",
    "abstract": "The article focuses on the implementation of the project for the classification of architectural styles of buildings. We use modern deep learning methods using convolutional neural networks for realization of this project. Image classification using CNN has many implementations. However, the recognition of architectural styles is not fully researched. This article presents a neural network capable of determining from a photograph of a building its belonging to a certain style of architecture. We train a deep CNN classifier model to classify buildings belonging to 15 different architectural styles. We use a data set that we have collected from open sources of the global Internet to do this. © 2021 IEEE.",
    "eid": "2-s2.0-85104706529"
  },
  {
    "title": "Proceedings of the 2024 18th International Conference on Ubiquitous Information Management and Communication, IMCOM 2024",
    "abstract": "The proceedings contain 99 papers. The topics discussed include: Deep-RSIv2: an efficient content-free deep learning approach for radiographs’ manufacturer and model identification; unveiling algorithm classification excellence: exploring calendula and coreopsis flower datasets with varied segmentation techniques; memory efficient with parameter efficient fine-tuning for code generation using quantization; emotional subtitles through speech in films: a case study; task execution promotion method by automatic generation of viewer comments for live commentary of work contents; comprehensive assessment of perovskite solar cell efficiency through holistic edge detection analysis of crystallographic grain size; play bricks IV: desktop and web-based play bricks app for architectural styles; and navigating digital transformation challenges: an exploration of employee attitudes, expectations, and support.",
    "eid": "2-s2.0-85188215024"
  },
  {
    "title": "Saliency-based selection of visual content for deep convolutional neural networks: Application to architectural style classification",
    "abstract": "The automatic description of digital multimedia content was mainly developed for classification tasks, retrieval systems and massive ordering of data. Preservation of cultural heritage is a field of high importance of application of these methods. We address classification problem in cultural heritage such as classification of architectural styles in digital photographs of Mexican cultural heritage. In general, the selection of relevant content in the scene for training classification models makes the models more efficient in terms of accuracy and training time. Here we use a saliency-driven approach to predict visual attention in images and use it to train a Deep Convolutional Neural Network. Also, we present an analysis of the behavior of the models trained under the state-of-the-art image cropping and the saliency maps. To train invariant models to rotations, data augmentation of training set is required, which posses problems of filling normalization of crops, we study were different padding techniques and we find an optimal solution. The results are compared with the state-of-the-art in terms of accuracy and training time. Furthermore, we are studying saliency cropping in training and generalization for another classical task such as weak labeling of massive collections of images containing objects of interest. Here the experiments are conducted on a large subset of ImageNet database. This work is an extension of preliminary research in terms of image padding methods and generalization on large scale generic database. © 2018, Springer Science+Business Media, LLC, part of Springer Nature.",
    "eid": "2-s2.0-85053042423"
  },
  {
    "title": "Employing Deep Learning Framework to Support Location Management for the Audio-Visual Industry",
    "abstract": "This paper presents a specialized tool for film producers and managers to extract useful information from images of different locations. The resulting framework can be used for image retrieval and other applications related to film production and location scouting. The framework uses deep learning models to extract labels, colors, seasons, emotions, and building architecture from input images. The methodology is described in detail, outlining the different steps involved in image processing and feature extraction. The label extraction module uses a transfer learning approach with pre-trained CNN models fine-tuned on a custom dataset of 106 classes. The color extraction module uses the LAB color space, a device-independent and perceptually uniform color space, in image processing applications, to accurately identify the dominant color, while the season extraction module extracts seasonal information from input images. The emotion extraction module identifies the emotion portrayed in an image, and the architectural style module automatically identifies the style of buildings in photos. Finally, the embedding module combines various vectors representing different image aspects to create a general embedding for each image. © 2023 IEEE.",
    "eid": "2-s2.0-85175611328"
  },
  {
    "title": "An empirical study on big video data processing: Architectural styles, issues, and challenges",
    "abstract": "Video data contributes to the majority of big data, henceforth, how to efficiently and effectively discovering knowledge from large-scale video data becomes a crucial challenge. In this paper, we propose multiple architectural styles for the domain of large-scale video data analytics services. These styles include online combined with offline processing style, distributed shared repositories, image mining and prediction services with deep learning techniques. These architectural styles are successfully implemented and examined in a number of domains including smart traffic and smart drones, as demonstrated in a middleware developed specifically for large-scale continuous video data processing. © 2016 IEEE.",
    "eid": "2-s2.0-85050876987"
  },
  {
    "title": "ARQGAN: An evaluation of generative adversarial network approaches for automatic virtual inpainting restoration of Greek temples",
    "abstract": "Image reconstruction has received much attention and has advanced in recent years with the rise of deep learning. Deep neural models have been able to perform image-to-image translation by transferring pictorial styles, coloring old photographs or filling in missing parts. This last technique is known as image inpainting and enables restoration of damaged or missing parts of an image or photograph to obtain the complete picture. However, it is not always possible to properly define which parts are missing or to identify where they are missing, as in the case of superimposing new information on an already complete image. In this paper, we propose the use of generative adversarial networks (GANs), a well-known deep learning model, for virtual inpainting restoration of artificial landscape images containing archaeological remains of Greek temples. The network identifies key features determined by the internal logic of the architectural style denoted by the ruins and adds the missing architectural elements to obtain an image of the restored building. Unlike other studies, it does not receive any information on which elements should be added or where. Virtual inpainting restoration is capable of representing a building's envelope but also integrates particular aspects of the building related to the architectural language used for its design. The restoration of the fundamental parts of the classical Greek order was consistent, and the results were evaluated with objective metrics and through a subjective survey between academics and architects. They showed that adding segmented images to the training dataset gives better results. © 2021 Elsevier Ltd",
    "eid": "2-s2.0-85105581024"
  },
  {
    "title": "Towards Hallucinating Machines - Designing with Computational Vision",
    "abstract": "There are particular similarities in how machines learn about the nature of their environment, and how humans learn to process visual stimuli. Machine Learning (ML), more specifically Deep Neural network algorithms rely on expansive image databases and various training methods (supervised, unsupervised) to “make sense” out of the content of an image. Take for example how students of architecture learn to differentiate various architectural styles. Whether this be to differentiate between Gothic, Baroque or Modern Architecture, students are exposed to hundreds, or even thousands of images of the respective styles, while being trained by faculty to be able to differentiate between those styles. A reversal of the process, striving to produce imagery, instead of reading it and understanding its content, allows machine vision techniques to be utilized as a design methodology that profoundly interrogates aspects of agency and authorship in the presence of Artificial Intelligence in architecture design. This notion forms part of a larger conversation on the nature of human ingenuity operating within a posthuman design ecology. The inherent ability of Neural Networks to process large databases opens up the opportunity to sift through the enormous repositories of imagery generated by the architecture discipline through the ages in order to find novel and bespoke solutions to architectural problems. This article strives to demystify the romantic idea of individual artistic design choices in architecture by providing a glimpse under the hood of the inner workings of Neural Network processes, and thus the extent of their ability to inform architectural design. The approach takes cues from the language and methods employed by experts in Deep Learning such as Hallucinations, Dreaming, Style Transfer and Vision. The presented approach is the base for an in-depth exploration of its meaning as a cultural technique within the discipline. Culture in the extent of this article pertains to ideas such as the differentiation between symbolic and material cultures, in which symbols are defined as the common denominator of a specific group of people.1 The understanding and exchange of symbolic values is inherently connected to language and code, which ultimately form the ingrained texture of any form of coded environment, including the coded structure of Neural Networks. A first proof of concept project was devised by the authors in the form of the Robot Garden. What makes the Robot Garden a distinctively novel project is the motion from a purely two dimensional approach to designing with the aid of Neural Networks, to the exploration of 2D to 3D Neural Style Transfer methods in the design process. © The Author(s) 2020.",
    "eid": "2-s2.0-85092700279"
  },
  {
    "title": "AN APPROACH WITH DEEP CONVOLUTIONAL NEURAL NETWORKS FOR ACCURATE ARCHITECTURAL STYLE CLASSIFICATION",
    "abstract": "Unlike other studies, this study aims to examine the effect of data diversity and quantity on the performance of a model rather than solely focusing on classifying architectural styles. It also seeks to emphasize the importance of selecting the appropriate number of classes in architectural style classification and to explore how determining the optimal number of classes affects the model's success. The first dataset comprises the original images (4776 images), the second dataset (10091 images) includes additional data and the third dataset (9552 images) is obtained through data augmentation. Using these three datasets, models were developed by reducing the number of classes with convolutional neural networks (CNNs), which utilize convolution layers to identify local features in the images and classify them by summarizing these features. The results of the developed models show that the method of adding data and increasing data decreased the success of architectural style classification, whereas reducing the number of styles increased it. This study may lay the groundwork for the development of deep learning models for future architectural style classification. The findings of this study can significantly impact various application areas, such as analyzing architectural styles, identifying historical periods and integrating them into architectural education. © 2024, Jomard Publishing. All rights reserved.",
    "eid": "2-s2.0-85213398602"
  },
  {
    "title": "Deep Learning for the Automatic Division of Building Constructions into Sections on Remote Sensing Images",
    "abstract": "Urban areas predominantly consist of complex building structures, which are assembled of multiple building sections. From very high resolution remote sensing imagery, not only roof-tops but also the separation lines between them are visible. Since fully convolutional neural network (FCN)-based methods have become the primary choice in segmentation approaches, they have been extensively used for automatic building footprint extraction. But each of the previous works on building segmentation either lacks separation of building blocks into sections or does not produce sections of regular appearance. We propose a two-stage approach to overcome these limitations. The first step segments building and separation lines using an FCN model and the second step produces building instances by using a learning-free method. Our model receives a top-down image and a digital surface model (DSM) patch in two separate encoders. The encoder features are summed before the skip connections, which utilize the encoder features from the current and higher-resolution feature maps. We train our model with regularization losses for building shapes and separation lines on both satellite and aerial imagery. We test our model on a city that was not previously included in the training phase to show that it has the capacity to generalize across different geographical locations and architectural styles. Furthermore, we use our building section instance predictions to generate: 1) vectorized building maps and 2) a level-of-detail-1 DSM.  © 2008-2012 IEEE.",
    "eid": "2-s2.0-85165302287"
  },
  {
    "title": "Data-Driven Interior Plan Generation for Residential Buildings in Vietnam",
    "abstract": "We propose a new data-driven technique to automatically and efficiently generate floor plans for residential buildings in Vietnam with certain boundaries. We focus on improving the accuracy of the algorithm that was developed in another country to match the architectural style in Vietnam. Along with collecting a large number of architectural plans in Vietnam, we have proposed a method of semi-automatic data labeling using CNN deep learning network. As the result, we achieved the overall accuracy over 85% for prediction room type and room location on the test dataset. © The Author(s), under exclusive license to Springer Nature Singapore Pte Ltd. 2024.",
    "eid": "2-s2.0-85189753930"
  },
  {
    "title": "Architectural style classification based on DNN model",
    "abstract": "Deep neural networks (DNN) have been widely used for image classification. One major hurdle of deep learning approaches is that large sets of labeled data are necessary, which can be prohibitively costly to obtain, particularly in architectural style classification. Data augmentation can alleviate this labeling effort. In this paper, we use data augmentation to increase the number of architectural style datasets. To extract building elements, the inputs are preprocessed by Deformable Part Model (DPM) first, and then the preprocessed images are sent to the data augmentation to increase the number of images. Next, we design a deep neural network based on GoogLeNet. The proposed network aims to learn robust feature embeddings to improve architectural style classification performance. Finally, architectural style can be classified by the robust feature embeddings. Experimental results show that our approach achieves promising performance and is superior to previous methods. © Springer Nature Switzerland AG 2019.",
    "eid": "2-s2.0-85086144925"
  },
  {
    "title": "Intra-class Classification of Architectural Styles Using Visualization of CNN",
    "abstract": "The classification of architectural style is one of the most challenging problems in architectural history due to its temporal inter-class relationships between different styles and geographical variation within one style. Previous computer version approaches have primarily focused on general classification of multiple architectural styles based on historical age, but very few studies have attempted deep learning to address intra-class classification problems according to geographical location, which might reveal the significance of local evolution and adaption of ancient architectural style. Therefore, we exemplified gothic architecture as a certain genre and leased a new dataset containing gothic architecture in three different countries: France, England, and Italy. Besides, a trained model is susceptible to overfitting due to fecundity of regional parameters and shortcoming of dataset. In this paper, we propose a new approach to accurately classify intra-class variance in the sense of their geographical locations: visualization of Convolutional Neural Network. Experimentation on this dataset shows that the approach of intra-class classification based on local features achieves high classification rate. We also present interpretable explanations for the results, to illustrate architectural indication of intra-class classification. © 2019, Springer Nature Switzerland AG.",
    "eid": "2-s2.0-85073910804"
  },
  {
    "title": "Emotion Detection Based on Facial Expression Using YOLOv5",
    "abstract": "Human emotions can be understood from facial expressions, a type of nonverbal communication. Facial emotion recognition is a technology that analyzes emotions from various sources such as images and videos. Emotion recognition is an important topic due to its wide range of applications. In this paper, the YOLOv5 (You Look Only Once) model was used to detect basic human emotions. Capturing facial expressions aids to identify the emotion based on which various suggestions can be proposed, such as songs and movie recommendations. There are numerous models for emotion detection in different architectural styles. In this article, we present a less explored YOLOv5 model. It is more accurate and gives a real time result than the previous detection algorithms. 40 images from the FER2013 dataset were used to train our YOLOv5 model and accuracy of 50% was achieved with the proposed model. © 2023, The Author(s), under exclusive license to Springer Nature Switzerland AG.",
    "eid": "2-s2.0-85164272876"
  },
  {
    "title": "Architectural Works of the Early Republic Period from an Artificial Intelligence Perspective; [Yapay Zekâ Perspektifinden Erken Cumhuriyet Dönemi Mimari Eserleri]",
    "abstract": "This study presents a versatile approach integrating various neural network architectures with a focus on classifying architectural works. To address the lack of suitable datasets in the literature, a custom dataset has been created and made publicly available. The study aims to determine the most effective model, taking into account fine details in architectural styles. In this context, a comparative analysis has been conducted on four different convolutional neural network (CNN) architectures, including a baseline model trained from scratch and models using transfer learning methods with VGG, ResNet, and EfficientNet architectures. Through experiments, the EfficientNet architecture was fine-tuned, achieving an accuracy of %84.65 for 3 architects and %74.08 for 16 architects. Additionally, the two obtained models were used as feature extractors to visualize relationships among architects in a 2D space using t-SNE dimension reduction technique. These promising results indicate that these techniques can significantly contribute to architectural style analysis and serve as valuable tools for creating innovative designs through the use of generative artificial intelligence. © 2024 IEEE.",
    "eid": "2-s2.0-85200903651"
  },
  {
    "title": "MonuMAI: Dataset, deep learning pipeline and citizen science based app for monumental heritage taxonomy and classification",
    "abstract": "An important part of art history can be discovered through the visual information in monument facades. However, the analysis of this visual information, i.e, morphology and architectural elements, requires high expert knowledge. An automatic system for identifying the architectural style or detecting the architectural elements of a monument based on one image will certainly help improving our knowledge in art and history. Building such tool is challenging as some styles share architectural elements, the bad conservation state of some monuments and the noise included in the image itself. The aim of this paper is to introduce MonuMAI (Monument with Mathematics and Artificial Intelligence) framework. In particular, (i) we designed MonuMAI dataset rich with expert knowledge considering the proposed architectural styles taxonomy and key elements relationship, which allows addressing several tasks, e.g., monument style classification and architectural elements detection, (ii) we developed MonuMAI deep learning pipeline based on lightweight MonuNet architecture for monument style classification and MonuMAI Key Elements Detection (MonuMAI-KED) model, and (iii) we built citizen science based MonuMAI mobile app that uses the proposed MonuMAI deep learning pipeline trained on MonuMAI dataset for performing in real life conditions. Our experiments show that both MonuNet architecture and the detection model achieve very good results under real life conditions. © 2020",
    "eid": "2-s2.0-85092227308"
  },
  {
    "title": "Classification of Indian Monument Architecture Styles Using Bi-Level Hybrid Learning Techniques",
    "abstract": "India is known for its rich architectural and cultural inheritance. In this research work, classification of the Indian historical monuments has been attempted in two levels, primarily based on the time period of its construction and secondly based on its architectural style, using machine learning (ML) and deep learning (DL) techniques. A rich corpus of monument images of varying historical periods and architectural styles has been collected from the web, blogs, and tourism websites. Feature extraction methods such as speeded-up robust feature (SURF), scale-invariant feature transform (SIFT), features from accelerated segment test (FAST), oriented FAST and rotated brief (ORB), Hu moments, image moments, and Zernike moments are used to extract the features from the input images. ML techniques such as decision tree algorithm (ID3) were used for time period classification in the first level and support vector machine (SVM) for classification of architectural style in the second level. Convolutional neural network (CNN) is designed and validated for training and testing images for both the levels of classification to observe the performance of DL technique in monument classification. Results of this research show that features extracted using Hu moments and Zernike moments resulted in improved accuracy compared to other feature sets. CNN outperforms ML approaches in overall accuracy in both levels of monument classification and also for few specific architectural styles. © 2022, The Author(s), under exclusive license to Springer Nature Singapore Pte Ltd.",
    "eid": "2-s2.0-85135816689"
  },
  {
    "title": "AI Image-based Systems for Enhancing the Cultural Tourism Experience",
    "abstract": "Technological innovation, conservation and enhancement are key elements for promoting cultural heritage and attracting visitors worldwide. Cultural tourism represents a significant economic and social strategy, capable of stimulating regional development and revitalizing marginalized areas. In recent years, artificial intelligence (AI) has transformed the sector, offering new ways to engage with and preserve cultural assets. This study explores the application of advanced AI techniques, particularly Convolutional Neural Networks (CNNs), to improve the classification and recognition of images related to architectural heritage. A deep learning algorithm specifically designed for cultural heritage enhancement is presented, focusing on the automatic classification of images of buildings and monuments. The analysis includes a comparison between pre-trained models and custom models, highlighting the performance of different approaches. The experimental results demonstrate that our ensemble model achieved 90% accuracy in classifying architectural heritage elements across 10 categories, with the Majority Vote Ensemble approach outperforming individual models by 6-10%. This improved classification accuracy enables more reliable automated systems for cultural heritage documentation and interactive tourist experiences. The research addresses key challenges in architectural heritage classification including variations in preservation state, lighting conditions, and complex backgrounds with multiple elements. The study also investigates the impact of data augmentation and class balancing techniques on model performance, demonstrating how these methods can mitigate limitations in training data availability. The developed ensemble combines state-of-the-art CNN architectures like ResNet50 and EfficientNet with custom models, leveraging their complementary strengths to achieve robust classification across diverse architectural styles and conditions. The adopted approach is supervised, using a training dataset where images are pre-labeled according to specific categories. This allows the algorithm to learn and subsequently predict the categories of new images based on the acquired information. A practical application is proposed to improve visitor experiences and heritage management, paving the way for future technological advancements in the field. © 2024 IEEE.",
    "eid": "2-s2.0-85217998269"
  },
  {
    "title": "Collapsed building detection using 3D point clouds and deep learning",
    "abstract": "Collapsed buildings should be detected with the highest priority during earthquake emergency response, due to the associated fatality rates. Although deep learning-based damage detection using vertical aerial images can achieve high performance, as depth information cannot be obtained, it is difficult to detect collapsed buildings when their roofs are not heavily damaged. Airborne LiDAR can efficiently obtain the 3D geometries of buildings (in the form of point clouds) and thus has greater potential to detect various collapsed buildings. However, there have been few previous studies on deep learning-based damage detection using point cloud data, due to a lack of large-scale datasets. Therefore, in this paper, we aim to develop a dataset tailored to point cloud-based building damage detection, in order to investigate the potential of point cloud data in collapsed building detection. Two types of building data are created: building roof and building patch, which contains the building and its surroundings. Comprehensive experiments are conducted under various data availability scenarios (pre–post-building patch, post-building roof, and post-building patch) with varying reference data. The pre–post scenario tries to detect damage using pre-event and post-event data, whereas post-building patch and roof only use post-event data. Damage detection is implemented using both basic and modern 3D point cloud-based deep learning algorithms. To adapt a single-input network, which can only accept one building’s data for a prediction, to the pre–post (double-input) scenario, a general extension framework is proposed. Moreover, a simple visual explanation method is proposed, in order to conduct sensitivity analyses for validating the reliability of model decisions under the post-only scenario. Finally, the generalization ability of the proposed approach is tested using buildings with different architectural styles acquired by a distinct sensor. The results show that point cloud-based methods can achieve high accuracy and are robust under training data reduction. The sensitivity analysis reveals that the trained models are able to locate roof deformations precisely, but have difficulty recognizing global damage, such as that relating to the roof inclination. Additionally, it is revealed that the model decisions are overly dependent on debris-like objects when surroundings information is available, which leads to misclassifications. By training on the developed dataset, the model can achieve moderate accuracy on another dataset with different architectural styles without additional training. © 2020 by the authors. Licensee MDPI, Basel, Switzerland.",
    "eid": "2-s2.0-85098259986"
  },
  {
    "title": "Towards Classification of Architectural Styles of Chinese Traditional Settlements Using Deep Learning: A Dataset, a New Framework, and Its Interpretability",
    "abstract": "The classification of architectural style for Chinese traditional settlements (CTSs) has become a crucial task for developing and preserving settlements. Traditionally, the classification of CTSs primarily relies on manual work, which is inefficient and time consuming. Inspired by the tremendous success of deep learning (DL), some recent studies attempted to apply DL networks such as convolution neural networks (CNNs) to achieve automated classification of the architecture styles. However, these studies suffer overfitting problems of the CNNs, leading to inferior classification performance. Moreover, most of the studies apply the CNNs as a black box providing limited interpretability. To address these limitations, a new DL classification framework is proposed in this study to overcome the overfitting problem by transfer learning and learning-based data augmentation technique (i.e., AutoAugment). Furthermore, we also employ class activation map (CAM) visualization technique to help understand how the CNN classifiers work to abstract patterns from the input. Specifically, due to a lack of architectural style datasets for the CTSs, a new annotated dataset is first established with six representative classes. Second, several representative CNNs are leveraged to benchmark the new dataset. Third, to address the overfitting problem of the CNNs, a new DL framework is proposed which combines transfer learning and AutoAugment to improve the classification performance. Extensive experiments are conducted on the new dataset to demonstrate the effectiveness of our framework. The proposed framework achieves much better performance than baselines, greatly mitigating the overfitting problem. Additionally, the CAM visualization technique is harnessed to explain what and how the CNN classifiers implicitly learn for recognizing a specified architectural style. © 2022 by the authors.",
    "eid": "2-s2.0-85140981367"
  },
  {
    "title": "Case study for digital cultural content mining",
    "abstract": "In this chapter we consider an application case of Deep Learning in the task of architectural recognition. The main objective is to identify both: architectural styles and specific architectural structures. We are interested in attention mechanisms in Deep CNNs and explain how real visual attention maps built upon human gaze fixations can help in the training of deep neural networks. © The Author(s), under exclusive license to Springer Nature Switzerland AG 2020.",
    "eid": "2-s2.0-85078856360"
  },
  {
    "title": "Simultaneous extraction of spatial and attributional building information across large-scale urban landscapes from high-resolution satellite imagery",
    "abstract": "Understanding urban dynamics requires comprehensive building analysis, yet current methods focusing on specific aspects hinder the production of unified and large-scale inventories. This study introduces a multi-task deep learning network with a flexible architecture for simultaneously extracting spatial and attributional building information from high-resolution satellite images. This method efficiently segments rooftops and classifies buildings by urban function and architectural style of rooftops. Moreover, a strategic spatial sampling scheme from a data-centric perspective, informed by geographic and environmental diversity, optimizes the selection of representative samples to improve training efficiency and predictive accuracy. Comparative analyses demonstrate the framework's superior performance, achieving an F1 score of 84.30% and an intersection over union of 72.86% in rooftop segmentation, and Kappa scores of 74.67% and 70.04% in classifying urban functions and architectural types, outperforming other advanced models by 2% to 25% across various metrics. Additionally, the adaptability of the network ensures that the framework meets diverse accuracy and efficiency requirements. By applying the proposed methodology to Shanghai, a unified city-scale dataset is generated. This dataset underscores the practical applicability and potential influence of the proposed methods in the fields of urban studies and sustainable development. © 2024 Elsevier Ltd",
    "eid": "2-s2.0-85189861815"
  },
  {
    "title": "Classification of Turkish and Balkan House Architectures Using Transfer Learning and Deep Learning",
    "abstract": "Classifying architectural structures is an important and challenging task that requires expertise. Convolutional Neural Networks (CNN), which are a type of deep learning (DL) approach, have shown successful results in computer vision applications when combined with transfer learning. In this study, we utilized CNN based models to classify regional houses from Anatolia and Balkans based on their architectural styles with various pretrained models using transfer learning. We prepared a dataset using various sources and employed data augmentation and mixup techniques to solve the limited data availability problem for certain regional houses to improve the classification performance. Our study resulted in a classifier that successfully distinguishes 15 architectural classes from Anatolia and Balkans. We explain our predictions using grad-cam methodology. © The Author(s), under exclusive license to Springer Nature Switzerland AG 2024.",
    "eid": "2-s2.0-85184088628"
  }
]